In [1]:
import pyodbc as pyodbc
import pandas as pd
from utils import  FileReader,FreeTextFileReader,OLTPReader

# CSV FILE

In [2]:
vendor_columns_mapping = {
    "Specialty":"SpecialtyName",
    "Start Hour":"startHour",
    "End Hour":"endHour"
}


combined_columns_mapping = {
   
}

In [4]:
status = None
with FileReader('data/Provider1.csv',vendor_columns_mapping,combined_columns_mapping,seperator=',') as csvReader:
    status = csvReader.status

Transforming csv file into DataFrame
Inserting data into database...
Finished inserting data into database

In [5]:
status

  ProviderName SpecialtyName      City  startHour  endHour  Cost  status error
0     mohammad  cardiologist  new york          9       12   100    True
1        ahmad  cardiologist     cairo          9       12   100    True

# TXT FILE

In [6]:
vendor_columns_mapping = {
    "Specialty":"SpecialtyName",
    "Start Hour":"startHour",
    "End Hour":"endHour"
}


combined_columns_mapping = {
    "ProviderName" : ["Fname","Lname"],
}

In [7]:
status = None
with FileReader('data/Provider3.txt',vendor_columns_mapping,combined_columns_mapping,seperator='|') as csvReader:
    status = csvReader.status

Transforming csv file into DataFrame
Inserting data into database...
Finished inserting data into database

In [8]:
status

,SpecialtyName,City,startHour,endHour,Cost,ProviderName,status,error
0,cardiologist,new york,9,12,100,mohammad nasser,True,
1,cardiologist,new york,9,12,100,ahmad mahmoud,True,

# Free Text File Using Model to Predict

In [9]:
with FreeTextFileReader('data/free_text.txt') as free_text_read:
    status = free_text_read.status

Inserting data into database...
Error executing query: INSERT INTO PotatoDataMartv1.dbo.LocationDim (City) VALUES ('salem nbennett spring nfort lewi nglenvar nhang rock nkessler mill nmason cove')
Error executing query: INSERT INTO PotatoDataMartv1.dbo.LocationDim (City) VALUES ('overland park nmerriam noverland nprairi villag nprairi vlg nshawne mission nshawne msn')
Error executing query: INSERT INTO PotatoDataMartv1.dbo.LocationDim (City) VALUES ('bicentenni nbrigg nw hollywood nwest hollywood nlos angel')
Error executing query: INSERT INTO PotatoDataMartv1.dbo.LocationDim (City) VALUES ('west harrison neast white plain nw harrison nwestchest counti airport nwhite plain')
Error executing query: INSERT INTO PotatoDataMartv1.dbo.LocationDim (City) VALUES ('littleton nhghlnds ranch nhighland ranch nlone tree nlonetre')
Finished inserting data into database

In [11]:
# set the width of the columns in the display
pd.set_option('display.max_colwidth', -1)
status[status['status']==False]

c:\Users\nasser\.conda\envs\finall\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Passing a negative integer is deprecated in version 1.0 and will not be supported in future version. Instead, use None to not limit the column width.

,ProviderName,SpecialtyName,startHour,endHour,Cost,City,status,error
11,WilliamDichtel,otolaryngologist ent,10,16,67,salem nbennett spring nfort lewi nglenvar nhang rock nkessler mill nmason cove,False,"[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]String or binary data would be truncated in table 'PotatoDataMartv1.dbo.LocationDim', column 'City'. Truncated value: 'salem nbennett spring nfort lewi nglenvar nhang ro'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)"
28,KathrynHartman,pediatr,10,15,52,overland park nmerriam noverland nprairi villag nprairi vlg nshawne mission nshawne msn,False,"[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]String or binary data would be truncated in table 'PotatoDataMartv1.dbo.LocationDim', column 'City'. Truncated value: 'overland park nmerriam noverland nprairi villag np'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)"
51,JeromeLipin,pediatr,9,14,33,bicentenni nbrigg nw hollywood nwest hollywood nlos angel,False,"[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]String or binary data would be truncated in table 'PotatoDataMartv1.dbo.LocationDim', column 'City'. Truncated value: 'bicentenni nbrigg nw hollywood nwest hollywood nlo'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)"
85,Amanda Ganem,cardiovascular diseas,8,16,21,west harrison neast white plain nw harrison nwestchest counti airport nwhite plain,False,"[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]String or binary data would be truncated in table 'PotatoDataMartv1.dbo.LocationDim', column 'City'. Truncated value: 'west harrison neast white plain nw harrison nwestc'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)"
91,JaniceBrenneman,hospit base physician radiolog,10,16,39,littleton nhghlnds ranch nhighland ranch nlone tree nlonetre,False,"[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]String or binary data would be truncated in table 'PotatoDataMartv1.dbo.LocationDim', column 'City'. Truncated value: 'littleton nhghlnds ranch nhighland ranch nlone tre'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)"

# OLTP Database Source

In [12]:
database = 'Potato'

In [13]:
status = []
with OLTPReader(database) as reader:
    status = reader.dfs

Transforming csv file into DataFrame
Inserting data into database...
Finished inserting data into database
Transforming csv file into DataFrame
Inserting data into database...
Finished inserting data into database
Finished inserting data into database

In [14]:
len(status)

2

In [17]:
status[0][1].head()

  SpecialtyName   City  Cost  startHour  endHour ProviderName  status error
0  denist        jenin  10    10         33       Mohammad 1   True